Revit 2027 API
CommandMenuItem.SetToolTip Method
 Set toolTip of CommandMenuItem
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetToolTip(
	string toolTip
)
Public Sub SetToolTip (
	toolTip As String
)
public:
void SetToolTip(
	String^ toolTip
)
member SetToolTip :
        toolTip : string -> unit
Parameters
toolTip String
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
CommandMenuItem Class
Autodesk.Revit.UI Namespace